//#pragma warning (disable:4996)
//#include <stdio.h>
//
//// 2차원 평면의 1사분면에서 그래프 y=x의 위쪽에 있으면서 원점으로부터 거리가 100 이하인 정수 좌표 점의 개수 (x좌표나 y좌표가 0이거나 그래프 y=x상에 있는 점 포함)
//int main()
//{
//	int count = 0;
//
//	/*for (int x = 0; x <= 100; x++) {
//		for (int y = 0; y <= 100; y++) {
//			if (y >= x && x * x + y * y <= 10000)
//				count++;
//		}
//	}*/
//
//
//	// (0,0), (0,1), .........., (0,100)
//	//        (1,1), (1,2), ..., (1,100)
//	//               (2,2), ..., (2,100)
//	// ...
//	//                           (100,100)
//	for (int x = 0; x <= 100; x++) {
//		for (int y = x; y <= 100; y++) {
//			if (x * x + y * y <= 10000)
//				count++;
//		}
//	}
//
//	printf("%d", count);
//}